{
    "title": "Homemade chocolate bar recipe",
    "ingredients": [
        {
            "For the peanut butter shortbread": [
                "85g unsalted butter",
                "85g smooth peanut butter",
                "75g light brown sugar",
                "¼ tsp salt",
                "175g plain flour"
            ]
        },
        {
            "For the caramel layer": [
                "300g caster sugar",
                "75g unsalted butter, diced",
                "200ml double cream",
                "3 tbsp honey",
                "150g salted peanuts"
            ]
        },
        {
            "For the coating": [
                "400g classic 74% dark chocolate",
                "80g smooth peanut butter",
                "1 tbsp vegetable oil",
                "25g salted peanuts, roughly chopped"
            ]
        }
    ],
    "prepTime": 25,
    "steps": [
      "To make the shortbread layer line a 20cm square cake tin with nonstick baking paper and preheat the oven to gas 4, 180°C, fan 160°C.",
      "Put the butter, peanut butter, sugar and salt into a mixing bowl and beat together until smooth and creamy. Add the flour and mix well until dough-like and combined completely. Tip the dough into the prepared tin and use your hands to press into an even layer. Put the cake tin into the fridge for about 30 mins or until the dough is firm.",
      "Prick the surface of the shortbread with a fork, then bake in the oven for 30-35 mins, until golden brown. Remove from the oven and leave to cool in the tin.",
      "To make the caramel layer put the sugar into a large saucepan set over medium heat and cook until melted and caramelised to a deep golden brown. Meanwhile, put the butter, cream and honey into a small saucepan and bring to a boil. When the sugar has caramelised, pour in the hot cream mixture in 2 batches, stirring vigorously until combined, then continue to cook for 3 mins or until the caramel reaches 125°C on a kitchen thermometer. Remove the pan from the heat and add the peanuts, mixing briefly. Immediately pour the caramel onto the shortbread layer and use a spatula to level out. Leave to cool for at least 4 hrs.",
      "Once cooled, melt the chocolate and peanut butter in a heatproof bowl set over a pan of just simmering water until melted and smooth, add the oil and mix together. Pour the chocolate mixture over the caramel layer, smooth the top and sprinkle over a few chopped peanuts. Chill in the fridge until set, before cutting into 14 bars."
    ],
    "author": "Tesco",
    "countryOfOrigin": "UK",
    "course": "Dessert"
  }